Repository: eddyem/fits_filter
Catalog: locale/*/*.po
Languages: ru

source: %s: argument needed!
ru: %s: необходим аргумент!

source: All 9999 files like %sXXXX.fits exists!
ru: Все 9999 файлов вида %sXXXX.fits заняты!

source: Brightness levels amount shoul be from 2 to 255
ru: Количество уровней градаций яркости должно быть от 2 до 255

source: Can't add record to list
ru: Не могу добавить запись в список

source: Can't close mmap'ed file
ru: Не могу закрыть ммапнутый файл

source: Can't copy data
ru: Не могу скопировать данные

source: Can't get settings
ru: Невозможно получить настройки

source: Can't make group operations 'in place'!
ru: Не могу выполнить групповую операцию с сохранением 'в тот же файл'!

source: Can't munmap
ru: Не могу сделать munmap

source: Can't open %s for reading
ru: Не могу прочитать %s

source: Can't read HDU
ru: Не могу прочесть HDU

source: Can't read file %s from sequence
ru: Не могу прочесть файл %s из последовательности

source: Can't read input file!
ru: Невозможно прочесть входной файл!

source: Can't remove file %s
ru: Не могу закрыть ммапнутый файл

source: Can't set settings
ru: Не могу сохранить настройки

source: Can't setup console
ru: Не могу нсатроить консоль,

source: Can't stat %s
ru: Не могу прочесть параметры %s

source: Conversion %s <%s> parameters:
ru: Преобразование %s: %s

source: Degrees should be less than 360
ru: Угол должен быть меньше 360 градусов

source: Error in group operation
ru: Ошибка при групповой обработке

source: Error on pipeline processing!
ru: Неправильный параметр: %s

source: FFTW error
ru: Ошибка FFTW

source: Filter FWHM should be not less than 1.
ru: Полуширина фильтра должна быть не меньше 1.

source: Filter window height changed to 5
ru: Высота фильтра изменена на 5

source: Filter window width changed to 5
ru: Ширина фильтра изменена на 5

source: Found %d pixels with undefined value
ru: Обнаружено %d пикселей с неопределенным значением

source: Group operations need at least two FITS-files
ru: Групповые операции требуют задания как минимум двух FITS-файлов

source: Image statistics after pipeline:
ru: Статистика по изображению после конвейера:

source: Images with > 2 dimensions are not supported
ru: Многомерные изображения не поддерживаются

source: Input image statistics:
ru: Статистика по входному изображению:

source: Integer out of range
ru: Целое вне допустимого диапазона

source: Missed input file name!
ru: Не задано имя входного файла

source: Mmap error for input
ru: Ошибка mmap

source: No filename given!
ru: Не задано имя файла

source: No input image given
ru: Не задано имя файла

source: No pipeline parameters given
ru: Неправильный параметр: %s

source: Parameter '-i' isn't used in group operations!
ru: Параметр '-i' не используется при групповых операциях!

source: Pipeline parameters:
ru: Параметры конвейера:

source: Posterisation filter parameters should be: %s
ru: Параметры фильтра постеризации должны быть такими: %s

source: Prewitt horizontal - simple derivative
ru: горизонтальный фильтр Прюитта (простейшая производная)

source: Prewitt vertical
ru: вертикальный фильтр Прюитта

source: Scharr (modified Sobel) horizontal
ru: горизонтальный фильтр Щарра (модифицированный Собель)

source: Scharr vertical
ru: вертикальный фильтр Щарра

source: Set output file name (-o) or its prefix (without key)
ru: Задайте имя выходного файла (-o) или его префикс (без ключа)

source: The amount of available files less than two
ru: оличество доступных файлов меньше двух

source: The output file exists
ru: Выходной файл существует

source: Unknown group operation
ru: Неизвестная групповая операция

source: Usage: %s [args] [outfile prefix] [file list for group operations] Where args are:
ru: Использование: %s [аргументы] [префикс выходного файла] Где аргументы:

source: Wrong argument "%s" of parameter "%s"
ru: Неправильный аргумент "%s" параметра "%s"

source: Wrong double number format!
ru: Неправильный формат числа double!

source: Wrong helpstring!
ru: Неправильный формат строки помощи

source: Wrong levels amount: %d
ru: Неправильное количество уровней: %d

source: Wrong parameter: %s
ru: Неправильный параметр: %s

source: Wrong pipeline 'type' parameter: %s
ru: Неправильный параметр: %s

source: Wrong pipeline parameters!
ru: Неправильно заданы параметры конвейера

source: You should at least give parameter 'type', for example: '-c type=help'
ru: Необходимо по крайней мере задать параметр 'type', например: '-c type=help'

source: You should set 'scale' parameter
ru: Не указан параметр scale

source: add record to FITS-header
ru: добавить запись в FITS-шапку

source: arguments are absent
ru: аргументы отсутствуют

source: calculate mean of specified FITS-files
ru: вычислить среднее арифметическое всех перечисленных изображений

source: calculate median of specified FITS-files
ru: вычислить медиану всех перечисленных изображений

source: calculate sum of specified FITS-files
ru: вычислить сумму всех перечисленных изображений

source: delete all records with given substring
ru: удалить все записи с указанной подстрокой

source: delete given key
ru: удалить указанный ключ

source: gaussian
ru: гауссов фильтр

source: horizontal Sobel
ru: горизонтальный фильтр Собеля

source: input file
ru: входной файл

source: laplasian of gaussian
ru: лапласиан гауссианы

source: median filter
ru: медианный фильтр

source: nsteps amount of steps scale scale type (uniform, log, exp, sqrt, pow)
ru: nsteps количество градаций яркости scale функция преобразования (uniform, log, exp, sqrt, pow)

source: output file
ru: выходной файл

source: posterisation
ru: "постеризация"

source: r radius of filter (uint, 0 for cross 3x3)
ru: r радиус фильтра (беззнаковое целое или 0 для "креста" 3x3)

source: rewrite output file if exists (works only with option -i)
ru: перезаписать выходной файл, если он существует (только с опцией -i)

source: save results into same file
ru: записать изменения в тот же файл

source: set pipeline parameters, arg: type=type:[help]:... type - transformation type (help for list) help - list of available parameters for given 'type'
ru: установить параметры конвейера, аргументы: type:[help]:... type - тип преобразования (help для справки) help - список доступных для данного 'type' опций

source: show statistic parameters of input and output image
ru: отобразить статистические параметры входного и выходного изображения

source: show this help
ru: отобразить эту справку

source: sigma_x is too low, set to 1.
ru: sigma_x слишком мала, устанавливаю в 1.

source: sigma_y is too low, set to 1.
ru: sigma_x слишком мала, устанавливаю в 1.

source: simple adaptive median filter
ru: простой адаптивный медианный фильтр

source: simple gradient (by Sobel)
ru: простой градиент (операторами Собеля)

source: sx,sy sigma by axes x & y w,h non-zero window width & height
ru: sx,sy параметр сигма по осям x и y w,h ширина и высота ненулевого окна фильтра

source: verbose level (each -v increase it)
ru: уровень подробностей вывода (каждый -v увеличивает его)

source: vertical Sobel
ru: вертикальный фильтр Собеля
